genesis0409/esp32_Daon_uxF_ISMS/src/main.cpp
#include <Arduino.h>
#include <esp_wifi.h>
#include <esp_now.h>
#include <esp32-sdi12.h>
#include "CRC.h"
#include "InputParams.h"

#define VERSION "0.2.1" // 송신 로직 개선, 디버그 로그 추가

#define ADDR_RK52002 0XFE

/* ----- Sensors ----- */

enum SensorId // enum은 값을 명시하지 않은 경우, 이전 항목의 값보다 1씩 증가하는 값을 자동으로 할당
{
  idTeros21SoilWaterPotential = 1,
  idWoosungRainDetector, // 2
  idHaimilRainDetector,  // 3
  // Complex Sensor (Only Wireless)
  idRk52002, // 4
  idRk52002Ec = 41,
  idRk52002Humi, // 42
  idRk52002Temp, // 43
  // Additional Sensor (Only Wireless, Not standard)
  idAddTeros21SoilWaterPotential = 5,
  idAddRk52002 = 6,
  idAddRk52002Ec = 61,
  idAddRk52002Humi = 62,
  idAddRk52002Temp = 63
};

// Number of sensor types
const int numberOfSensors = 6;
unsigned long heartbeatTimes[numberOfSensors];      // 센서별 timeout 계산에 필요한 millis() 값을 저장하는 배열
const unsigned long heartbeatTimeout = 1800 * 1000; // 1800초, 30분
void checkHeartbeatTime(int id);                    // 사용 안하는듯?
void resetSensorDataRegisters(int sensorType);      // 센서 타입(코드번호)으로 구분하여 레지스터 주소 설정

// Function to register in the registerMap.; 센서 연결 시 레지스터맵에 기록하는 함수
void attachTeros21SoilWaterPotential();
void attachWoosungRainDetector();
void attachHaimilRainDetector();
void attachRk52002();

// Function that reads sensor information and stores it in a registerMap and espnowData.; 센서값 획득 함수
void getTeros21SoilWaterPotential();
void getWoosungRainDetector(); // 단종
void getHaimilRainDetector();  // 단종
void getRk52002();

// Array of function pointers; 함수포인터로 함수선택
void (*attachSensors[numberOfSensors])() = {attachTeros21SoilWaterPotential, attachWoosungRainDetector, attachHaimilRainDetector, attachRk52002};
void (*getSensors[numberOfSensors])() = {getTeros21SoilWaterPotential, getWoosungRainDetector, getHaimilRainDetector, getRk52002};

// Function to set sensor pins.
void initSensorPins();

// Function to obtain the starting address of the register map that stores sensor data.
int getDataStoringIndex(int sensorType);

// SDI-12
const int sdi12DataPin = 5;
const int deviceAddr = 0;
ESP32_SDI12 sdi12(sdi12DataPin);
float sdi12Values[10];
uint8_t numberOfReturnedValues;

// EL817
const int el817Pin = 4;
float rainValue;

// Battery Analog Pin
const int batteryCheckPin = 32; // ADC1핀(32~35) 사용해야; ADC2는 WIFI 점유

/* ----- AP Mode ----- */

AsyncWebServer server(80);

InputParams params(numberOfSensors);

int loopFlag = 0;

enum LoopMode
{
  apMode = 1,
  wiredMode,
  wirelessRs485Mode,
  wirelessSensingMode
};

/* ----- ESP-NOW ----- */

typedef struct structMessage // structMessage 자료형
{
  int id;               // esp 센서보드의 id
  float sensorData;     // 센서 값
  uint16_t sensorState; // 센서 상태
  uint16_t battery;     // 배터리 전압값
} structMessage;

structMessage espnowData;
esp_now_peer_info_t peerInfo;

/* ----- KS3267 ----- */

enum ERROR_CODE
{
  illegalFunction = 1,
  illegalDataAddress,
  illegalDataValue,
  slaveDeviceFailure
};

const int ledPin = 2;
const int rs485TxPin = 17;
const int rs485RxPin = 16;
const int rs485TxEnPin = 12;
const int registerMapSize = 392;
const int mbFrameMaxSize = 256;
const int readHoldingRegisters = 0x03;

uint16_t registerMap[registerMapSize + 1]; // Index 0 is not used.

/* ----- Declare Setup Functions ----- */

void setupApMode(); // wifi manager 설정

void setupWiredMode();           // 유선 / 표준화 모드 (RS485 통신보드; Slave)
void setupWirelessRs485Mode();   // 무선 / 표준화 모드 (RS485 통신보드; Slave, ESP-NOW Slave)
void setupWirelessSensingMode(); // 무선 / 센서 모드 (센서 정보 측정; Master, ESP-NOW Master)

void initRs485();                               // RS485 통신 설정
void initWiredRegisterMap(int sensorTypeIndex); // 유선 모드에서 노드정보와 센서정보를 설정하는 함수
void initWirelessRegisterMap();                 // 무선 모드에서 노드정보와 센서정보를 설정하는 함수

void setNodeInfo(); // 노드 정보 설정
void setNodeAttachSensorInfo(int index);

/* ----- Declare Loop Functions ----- */

void loopWiredMode();
void loopWirelessRs485Mode();
void loopWirelessSensingMode();

/* ----- Declare Others ----- */

void blinkLed();
int charToInt(char c);

uint16_t getBatteryPercentage(int sensorType); // SZH-SSBH-043 모듈 사용, 전압값 계산
bool sendsOthersData = false;                  // hasCrcError() 함수와 연동하여 온도/전압 및 다른 센서값 전송 여부 결정

void onDataSent(const uint8_t *mac_addr, esp_now_send_status_t status);
void onDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len);

/* ----- Declare Modbus Functions (modbus.cpp) ----- */

void addCrc(byte buf[], int bufLen);               // CRC 계산해 마지막 2바이트에 붙이는 함수
uint16_t combineByte(byte highData, byte lowData); // 상위 8비트와 하위 8비트 결합
void receiveModbusFrame(byte *frame, int *frameLen);
bool hasRequestError(byte *mbRequest, int mbRequestLen, int slaveAddress);
bool hasCrcError(byte frame[], int frameLen);
void sendErrorResponse(int errorCode, byte slaveAddress, byte functionCode);
void sendResponse(byte *response, int responseLen);
void saveFloatToRegisterMap(float value, int startIndex);
void modbusDebugPrint(byte *buf, int bufLen);

/* ----- Declare Sensor Functions (sensor.cpp) ----- */

void checkSensorAwakeTime(int id); // onDataRecv에서 센서타입(id)을 받아 millis()로 타임아웃 계산

/* ----- Main ----- */

void setup()
{
  Serial.begin(115200);
  Serial.println("Sensor Board ver" + String(VERSION));
  Serial.println("Board Mac Address: " + WiFi.macAddress());

  initSPIFFS();
  params.readFromFile(); // 사전 입력값을 불러옴

  if (params.checkSettingValues()) // 사전 입력값 검증
  {
    params.showSettingValues();

    if (params.isWiredCommunicationMode())
    {
      setupWiredMode();
      loopFlag = wiredMode;
    }
    else if (params.isWirelessCommunicationMode() && params.isRs485Mode())
    {
      setupWirelessRs485Mode();
      loopFlag = wirelessRs485Mode;
    }
    else if (params.isWirelessCommunicationMode() && params.isSensingMode())
    {
      setupWirelessSensingMode();
      loopFlag = wirelessSensingMode;
    }
  }
  else
  {
    setupApMode(); // wifi manager 설정
    loopFlag = apMode;
  }
}

void loop()
{
  switch (loopFlag)
  {
  case apMode:
    return;
  case wiredMode:
    loopWiredMode();
    break;
  case wirelessRs485Mode:
    loopWirelessRs485Mode();
    break;
  case wirelessSensingMode:
    loopWirelessSensingMode();
    break;
  default:
    break;
  }
}

/* ----- Setup Functions ----- */

void setupApMode()
{
  Serial.println("Setting AP (Access Point)");

  // WiFi.softAP("ESP-WIFI-MANAGER", NULL);
  // WiFi.softAP("uxF-StandardBoard-test", NULL);
  WiFi.softAP("uxF-SensorBoard02-test", NULL);

  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
  Serial.println(IP);

  // Web Server Root URL
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(SPIFFS, "/wifimanager.html", "text/html"); });

  server.serveStatic("/", SPIFFS, "/");

  server.on("/", HTTP_POST, [](AsyncWebServerRequest *request)
            {
    int paramsCnt = request->params();
    for (int i = 0; i < paramsCnt; i++)
    {
      AsyncWebParameter* p = request->getParam(i);
      if (p->isPost())
      {
        params.setParam(p);
      }
    }
    params.writeToFile();
    request->send(200, "text/plain", "Done. ESP will restart");
    delay(3000);
    ESP.restart(); });
  server.begin();
}

