genesis0409/esp32_Daon_uxF_ISMS/src/main.cpp
// 유선 표준화 모드
void setupWiredMode()
{
  Serial.println("Start wired Mode");

  initRs485();

  initSensorPins();

  initWiredRegisterMap(params.sensorType);
}

// 무선 표준화 모드; MAC 주소 임의설정; ESP-NOW 사용 (Slave)
void setupWirelessRs485Mode()
{
  Serial.println("Start wireless Rs485 Mode");

  initRs485();

  WiFi.mode(WIFI_STA);

  esp_wifi_set_mac(WIFI_IF_STA, &params.newMacAddress[0]); // wifi manager 사전입력 mac 주소로 변경
  Serial.print("[NEW] Broadcast MAC Address of RS485 Board :  ");
  Serial.println(WiFi.macAddress());

  if (esp_now_init() != ESP_OK)
  {
    Serial.println("Error initializing ESP-NOW");
    return;
  }

  esp_now_register_recv_cb(onDataRecv);

  initWirelessRegisterMap();
}

// 무선 센서 모드; 임의설정된 MAC 주소로 peer 등록; ESP-NOW 사용 (Master)
void setupWirelessSensingMode()
{
  Serial.println("Start wireless Sensing Mode");

  initRs485();
  initSensorPins();

  pinMode(32, INPUT); // 배터리 전압 확인 용도?

  WiFi.mode(WIFI_STA);

  if (esp_now_init() != ESP_OK)
  {
    Serial.println("Error initializing ESP-NOW");
    return;
  }

  esp_now_register_send_cb(onDataSent);

  memcpy(peerInfo.peer_addr, params.newMacAddress, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  if (esp_now_add_peer(&peerInfo) != ESP_OK)
  {
    Serial.println("Failed to add peer");
    return;
  }
}

// RS485 통신 설정
void initRs485()
{
  Serial2.begin(9600, SERIAL_8N1, rs485RxPin, rs485TxPin);
  pinMode(ledPin, OUTPUT);

  // GPIO12: RS485_DE
  pinMode(rs485TxEnPin, OUTPUT);
  digitalWrite(rs485TxEnPin, LOW);
}

// 유선 모드에서 노드정보와 센서정보를 설정하는 함수
void initWiredRegisterMap(int sensorTypeIndex)
{
  setNodeInfo();
  setNodeAttachSensorInfo(sensorTypeIndex);
}

// 무선 모드에서 노드정보와 센서정보를 설정하는 함수
void initWirelessRegisterMap()
{
  setNodeInfo();
  for (int i = 0; i < params.sensor.length(); i++)
  {
    setNodeAttachSensorInfo(charToInt(params.sensor[i]));
  }
}

// 노드 정보를 registerMap배열에 설정
void setNodeInfo()
{
  const uint16_t notUsed = 0;
  uint16_t nodeInfo[] = {notUsed, 0, 0, 1, 0, 10, 30}; // 노드 정보; 7개원소; 무슨 의미일까?
  memcpy(registerMap, nodeInfo, sizeof(nodeInfo));     // 노드 정보를 레지스터맵 [0]~[6] 까지 복사
}

// 센서 정보를 노드(레지스터 맵)에 설정
void setNodeAttachSensorInfo(int index)
{
  if (index < 1 || index > numberOfSensors) // 센서 타입 인덱스 유효성 검사 (wifimanager 센서번호)
  {
    Serial.println("Unsupported sensor type.");
    return;
  }
  Serial.println("Sensor type " + String(index) + " is attached");
  (*attachSensors[index - 1])(); // 함수 포인터: 인덱스에 해당하는 함수를 호출해 센서 타입 초기화 -> 레지스터맵에 센서 등록
}

/* ----- Loop Functions ----- */

// Modbus 통신을 처리하는 루프; modbus 요청수신 - 유효성검사 - 레지스터읽고 응답
void loopWiredMode()
{
  // Modbus 요청 수신 및 처리
  byte mbRequest[mbFrameMaxSize] = {
      // modbus 요청을 저장할 배열 0 초기화
      0,
  };
  int mbRequestLen = 0;                         // modbus 요청 길이
  receiveModbusFrame(mbRequest, &mbRequestLen); // modbus 요청 수신하여 배열에 저장

  // 요청 유효성 검사 및 디버깅 출력
  if (mbRequestLen > 0) // 요청이 있는 경우
  {
    Serial.print("Modbus request: ");
    modbusDebugPrint(mbRequest, mbRequestLen); // 요청 수신되면 요청 내용을 디버깅 출력

    if (hasRequestError(mbRequest, mbRequestLen, params.modbusAddress)) // 요청 유효성 검사
    {
      Serial.println("Modbus request error.");
      return;
    }

    uint16_t functionCode = mbRequest[1];     // modbus function code 추출
    if (functionCode == readHoldingRegisters) // func code: 0x03
    {
      uint16_t startAddress = combineByte(mbRequest[2], mbRequest[3]);      // 시작 주소 추출
      uint16_t numberOfRegisters = combineByte(mbRequest[4], mbRequest[5]); // 레지스터 수 추출

      // Request error check; 요청 오류 검사
      if (!(numberOfRegisters >= 0x0001 && numberOfRegisters <= 0x007D))
      {
        sendErrorResponse(illegalDataValue, params.modbusAddress, functionCode); // 잘못된 데이터 '값' 오류 응답을 전송
        return;
      }
      if (!(startAddress >= 0 && startAddress <= 598 && startAddress + numberOfRegisters <= 599))
      {
        sendErrorResponse(illegalDataAddress, params.modbusAddress, functionCode); // 잘못된 데이터 '주소' 오류 응답을 전송
        return;
      }

      // Sensing Functions; 센서 데이터 수집
      (*getSensors[params.sensorType - 1])(); // 배열의 함수 포인터를 사용해 현재 센서 타입에 맞는 데이터를 수집하는 함수 호출

      // Modbus 응답 생성 및 전송
      //  Send Response; 응답 전송 준비
      int mbResponseLen = numberOfRegisters * 2 + 5; // 응답 길이 계산
      byte mbResponse[mbResponseLen];
      mbResponse[0] = params.modbusAddress;  // 응답의 첫 바이트: Modbus 주소
      mbResponse[1] = functionCode;          // 응답의 두 번째 바이트: Function Code
      mbResponse[2] = numberOfRegisters * 2; // 바이트 수

      // 레지스터 데이터 채우기
      for (int i = 3; i < mbResponseLen - 2; i += 2)
      {
        mbResponse[i] = (registerMap[startAddress + i - (i + 3) / 2]) >> 8;
        mbResponse[i + 1] = (registerMap[startAddress + i - (i + 3) / 2]) & 0xFF;
      }
      addCrc(mbResponse, mbResponseLen); // CRC 추가

      Serial.print("Modbus response: ");
      modbusDebugPrint(mbResponse, mbResponseLen); // 응답 디버그 출력

      sendResponse(mbResponse, mbResponseLen); // 응답 전송
      Serial.println("");
      blinkLed(); // LED 깜박임
    }
    else
    {
      sendErrorResponse(illegalFunction, params.modbusAddress, functionCode); // 잘못된 기능 코드 오류 응답 전송
    }
  }
}

// 무선 표준화 모드에서 실행되는 loop()
void loopWirelessRs485Mode()
{
  for (int i = 0; i < numberOfSensors; i++)
  {
    if ((heartbeatTimes[i] != 0))
    {
      if (millis() - heartbeatTimes[i] > heartbeatTimeout)
      {
        Serial.println("Error : Sensor Type " + String(i + 1) + " is not response.");
        delay(10);
        resetSensorDataRegisters(i + 1);
        heartbeatTimes[i] = millis(); // 시간 초기화
      }
    }
  }

  byte mbRequest[mbFrameMaxSize] = {
      0,
  };
  int mbRequestLen = 0;
  receiveModbusFrame(mbRequest, &mbRequestLen);

  if (mbRequestLen > 0)
  {
    Serial.print("Modbus request: ");
    modbusDebugPrint(mbRequest, mbRequestLen);

    if (hasRequestError(mbRequest, mbRequestLen, params.modbusAddress))
    {
      Serial.println("Modbus request error.");
      return;
    }

    uint16_t functionCode = mbRequest[1];
    if (functionCode == readHoldingRegisters)
    {
      uint16_t startAddress = combineByte(mbRequest[2], mbRequest[3]);
      uint16_t numberOfRegisters = combineByte(mbRequest[4], mbRequest[5]);

      // Request error check.
      if (!(numberOfRegisters >= 0x0001 && numberOfRegisters <= 0x007D))
      {
        sendErrorResponse(illegalDataValue, params.modbusAddress, functionCode);
        return;
      }
      if (!(startAddress >= 0 && startAddress <= 598 && startAddress + numberOfRegisters <= 599))
      {
        sendErrorResponse(illegalDataAddress, params.modbusAddress, functionCode);
        return;
      }

      // Send Response
      int mbResponseLen = numberOfRegisters * 2 + 5;
      byte mbResponse[mbResponseLen];
      mbResponse[0] = params.modbusAddress;
      mbResponse[1] = functionCode;
      mbResponse[2] = numberOfRegisters * 2;

