genesis0409/esp32_Daon_uxF_ISMS/src/main.cpp
      for (int i = 3; i < mbResponseLen - 2; i += 2)
      {
        mbResponse[i] = (registerMap[startAddress + i - (i + 3) / 2]) >> 8;
        mbResponse[i + 1] = (registerMap[startAddress + i - (i + 3) / 2]) & 0xFF;
      }
      addCrc(mbResponse, mbResponseLen);

      Serial.print("Modbus response: ");
      modbusDebugPrint(mbResponse, mbResponseLen);

      sendResponse(mbResponse, mbResponseLen);
      blinkLed();
    }
    else
    {
      sendErrorResponse(illegalFunction, params.modbusAddress, functionCode);
    }
  }
}

void loopWirelessSensingMode()
{
  for (int i = 0; i < params.sensor.length(); i++)
  {
    int index = charToInt(params.sensor[i]);
    Serial.print("Sensor index: ");
    Serial.println(index);
    if (index < 1 || index > numberOfSensors)
    {
      Serial.println("Unsupported sensor type.");
    }
    else
    {
      // Sensing Functions; 센서값 획득
      (*getSensors[index - 1])();

      // Check Wireless Sensor Board Battery.
      uint16_t batteryCharge = getBatteryPercentage(index);
      Serial.printf("battery Percentage: %u%%\n", batteryCharge);
      espnowData.battery = batteryCharge;

      if (sendsOthersData) // getRk52002()의 hasCrcError() 발생 시 전송 차단
      {
        // Send message via ESP-NOW; 이 부분은 온도/배터리값 합쳐서 보내는듯? + 온도 뿐만아니라 수분장력 등 다른 센서값도 사용하는 영역
        esp_err_t result = esp_now_send(params.newMacAddress, (uint8_t *)&espnowData, sizeof(espnowData));

        if (result != ESP_OK)
        {
          Serial.println("Error : send esp-now RK520-02: Temp/BattV data.");
          Serial.print("Code: ");
          Serial.println(result);
        }
      }
      else
      {
        Serial.println("Not send ESP-NOW data.");
      }
    }
  }

  int timeDelay = params.sleepPeriod * 1000;
  delay(timeDelay);
  Serial.println("\r\n");
}

/* ----- Others ----- */

uint16_t getBatteryPercentage(int sensorType)
{
  float analogVal = analogRead(batteryCheckPin);    // 0~4095 12비트 해상도
  float vout = analogVal * 3.3 / 4095;              // 아날로그 값을 전압으로 변환 esp32(0~4095) -> (0~3.3v)
  float vin = vout / (7500.0 / (30000.0 + 7500.0)); // SZH-SSBH-043 모듈 저항의 전압 분배에 의한 5배 역산

  // Serial.print("Input Analog Value: ");
  // Serial.println(analogVal);
  // Serial.print("Analog to Voltage (max 3.3v): ");
  // Serial.println(vout);
  // Serial.print("Battery Voltage: ");
  // Serial.println(vin);

  const float dischargeVolt = 7.6;
  const float fullchargeVolt = 12.29;

  if (vin <= dischargeVolt)
  {
    return 0;
  }
  else if (vin >= fullchargeVolt)
  {
    return 100;
  }
  else
  {
    return (uint16_t)(((vin - dischargeVolt) / (fullchargeVolt - dischargeVolt)) * 100.0);
  }
}

void blinkLed()
{
  digitalWrite(ledPin, HIGH);
  delay(100);
  digitalWrite(ledPin, LOW);
}

int charToInt(char c)
{
  return (c >= '0' && c <= '9') ? (c - '0') : 0;
}

void onDataSent(const uint8_t *mac_addr, esp_now_send_status_t status)
{
  Serial.print("Last Packet Send Status: ");
  Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success." : "Delivery Fail...");
}

void onDataRecv(const uint8_t *mac_addr, const uint8_t *incomingData, int len)
{
  // 송신자 정보 출력
  // MAC Addr
  char macStr[18]; // 2자리씩 6개 바이트 + 5개 구분자 + '\0'
  Serial.print("Packet received from: ");
  // snprintf() 함수로 포맷 지정 문자열을 사용해 mac 주소 형식의 문자열로 변환, 'macStr'에 저장
  snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X:%02X:%02X:%02X", mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
  Serial.println(macStr);
  memcpy(&espnowData, incomingData, sizeof(espnowData)); // incomingData 배열에 수신된 데이터를 espnowData 구조체로 복사
  Serial.printf("Sensor Type: %u \r\n", espnowData.id);  // %u 부호 없는 10진 정수

  checkSensorAwakeTime(espnowData.id); // 센서 타임아웃 갱신

  // 센서명+센서값 출력
  String sensorName;
  switch (espnowData.id)
  {
  case 1:
    sensorName = "Teros-21 Water Potential";
    break;
  case 41:
    sensorName = "RK520-02 EC";
    break;
  case 42:
    sensorName = "RK520-02 HUMI";
    break;
  case 43:
    sensorName = "RK520-02 TEMP";
    break;
  default:
    break;
  }
  Serial.print(sensorName);
  Serial.printf(": %.2f \r\n", espnowData.sensorData); // %u 부호 없는 10진 정수

  // save sensor data
  int regMapIndex = getDataStoringIndex(espnowData.id);
  saveFloatToRegisterMap(espnowData.sensorData, regMapIndex);

  // save battery
  int sensorId = espnowData.id > 10 ? espnowData.id / 10 : espnowData.id;
  if (sensorId <= 4)
  {
    registerMap[293] = espnowData.battery;
  }
  else if (sensorId == 5 || sensorId == 6)
  {
    registerMap[393] = espnowData.battery;
  }
  else
  {
    Serial.println("ESP-NOW sensor ID error.");
  }
}

// modbus.cpp ************************************************************************************************************************************
void addCrc(byte buf[], int bufLen)
{
  uint16_t crc = calcCRC16(buf, bufLen - 2, 0x8005, 0xFFFF, 0, true, true); // CRC16 값 계산, true, true는 영향 없나?
  byte crcHigh = crc >> 8;                                                  // 계산된 16비트 CRC 값의 상위 8비트
  byte crcLow = crc & 0xFF;                                                 // 계산된 16비트 CRC 값의 하위 8비트
  *(buf + (bufLen - 2)) = crcLow;                                           // 버퍼의 마지막에서 두 번째 위치에 하위 8비트 저장
  *(buf + (bufLen - 1)) = crcHigh;                                          // 버퍼의 마지막 위치에 상위 8비트 저장
}

uint16_t combineByte(byte highData, byte lowData)
{
  return ((uint16_t)highData << 8) | lowData;
}

// Serial2 포트에서 Modbus 프레임을 수신하여 주어진 프레임 배열에 저장하고, 프레임의 길이를 갱신합니다.
// 각 바이트를 읽은 후에는 짧은 지연을 추가하여 다음 바이트가 수신될 때까지 기다립니다.
void receiveModbusFrame(byte *frame, int *frameLen)
{
  while (Serial2.available())
  {                                    // Serial2 포트에 수신된 데이터가 있는지 확인
    frame[*frameLen] = Serial2.read(); // 데이터를 읽어와 프레임 배열에 저장
    (*frameLen)++;                     // 프레임 길이를 1 증가
    delayMicroseconds(1250);           // 1/9600*8*1.5 sec, 다음 바이트를 읽기 전에 짧은 지연(1.25밀리초)
                                       // 9600 baud의 통신 속도에서는 1 바이트(8비트)를 전송하는 데 약 1.04밀리초가 필요하며,
                                       // 여기에 안전 마진을 고려하여 1.5배를 곱한 값입니다.
                                       // 이는 연속된 바이트 사이에 적절한 간격을 유지하여 데이터 수신이 안정적으로 이루어지도록 합니다.
  }
}

bool hasRequestError(byte *mbRequest, int mbRequestLen, int slaveAddress)
{
  return mbRequest[0] != slaveAddress || mbRequestLen < 2 || hasCrcError(mbRequest, mbRequestLen);
}

