genesis0409/esp32_Daon_uxF_ISMS/src/main.cpp
// 주어진 프레임의 CRC를 검증하여 오류가 있는지 확인하는 함수 (Cyclic Redundancy Check)
bool hasCrcError(byte frame[], int frameLen)
{
  if (frameLen < 2) // 프레임 길이가 2보다 작은 경우 유효한 CRC를 포함할 수 없음으로 오류
  {
    Serial.println("Debug Point 01: frameLen < 2");
    Serial.printf("frameLen: %d\n", frameLen);
    return true;
  }

  byte dataField[frameLen - 2]; // 프레임에서 마지막 두 바이트(CRC)를 제외한 데이터를 복사
  for (int i = 0; i < frameLen - 2; i++)
  {
    dataField[i] = frame[i];
  }
  uint16_t newCrc = calcCRC16(dataField, frameLen - 2, 0x8005, 0xFFFF, 0, true, true);
  byte newCrcHighByte = newCrc >> 8;  // CRC 상위 바이트
  byte newCrcLowByte = newCrc & 0xFF; // CRC 하위 바이트

  Serial.printf("(High)frameCRC[frameLen-1]: %x\n", frame[frameLen - 1]);
  Serial.printf("(Low)frameCRC[frameLen-2]: %x\n", frame[frameLen - 2]);

  Serial.print("newCRC: ");
  Serial.printf("%x\n", newCrc);

  // 프레임의 CRC와 계산된 CRC를 비교
  return frame[frameLen - 1] != newCrcHighByte ||
         frame[frameLen - 2] != newCrcLowByte;
}

// 특정 오류 코드를 포함한 Modbus 예외 응답을 생성하는 함수
void sendErrorResponse(int errorCode, byte slaveAddress, byte functionCode)
{
  int exceptionResponseBufLen = 5;                    // 예외 응답 버퍼의 길이 설정 (5 Bytes)
  byte exceptionResponseBuf[exceptionResponseBufLen]; // 예외 응답 버퍼 선언

  exceptionResponseBuf[0] = slaveAddress;                // 슬레이브 주소 설정
  exceptionResponseBuf[1] = functionCode + 0x80;         // 기능 코드에 0x80을 더하여 예외 응답 코드로 설정
  exceptionResponseBuf[2] = errorCode;                   // 오류 코드 설정
  addCrc(exceptionResponseBuf, exceptionResponseBufLen); // CRC를 예외 응답 버퍼에 추가 (CRC: 데이터 무결성 확인용)

  sendResponse(exceptionResponseBuf, exceptionResponseBufLen); // 오류 응답 전송
}

// 주어진 응답 데이터를 RS485 통신으로 전송하는 함수
void sendResponse(byte *response, int responseLen)
{
  digitalWrite(rs485TxEnPin, HIGH);     // RS485 송신 모드로 전환
  Serial2.write(response, responseLen); // 응답 데이터 전송; response 배열의 데이터를 responseLen 길이만큼 전송
  Serial2.flush();                      // 모든 데이터 전송 완료 대기; flush() 함수는 송신 버퍼가 비워질 때까지 블록됩니다.
  digitalWrite(rs485TxEnPin, LOW);      // RS485 수신 모드로 전환
}

void saveFloatToRegisterMap(float value, int startIndex)
{
  const int minFieldIndex = 203;
  // const int maxFieldIndex = 292;
  const int maxFieldIndex = 392;
  const int sensorState = 0;

  if (startIndex < minFieldIndex || startIndex > maxFieldIndex)
  {
    Serial.println("Invalid registerMap Index");
    return;
  }

  uint32_t bits = *(reinterpret_cast<uint32_t *>(&value));
  uint16_t bottom16bits = bits & 0xFFFF;
  uint16_t top16bits = bits >> 16;

  registerMap[startIndex] = bottom16bits;
  registerMap[startIndex + 1] = top16bits;
  registerMap[startIndex + 2] = sensorState;
}

void modbusDebugPrint(byte *buf, int bufLen)
{
  for (int i = 0; i < bufLen; i++)
  {
    if (buf[i] < 0x10)
    {
      Serial.print("0");
    }
    Serial.print(buf[i], HEX);
    Serial.print(" ");
  }
  Serial.println("");
}

// sensor.cpp ************************************************************************************************************************************
// Sensor Function Implementation File

// Function to set sensor pins.
void initSensorPins()
{
  sdi12.begin();            // 수분장력 센서용
  pinMode(el817Pin, INPUT); // 감우센서용
}

// Function to obtain the starting address of the register map that stores sensor data.
int getDataStoringIndex(int sensorType)
{
  switch (sensorType)
  {
  // WaterPotential
  case 1:
    return 251;
  // Rain
  case 2:
  case 3:
    return 218;
  // Wireless only Composite sensor 4 (401~403)
  case 41: // RK520-02 EC
    return 242;
  case 42: // RK520-02 HUMI
    return 248;
  case 43: // RK520-02 TEMP
    return 257;
  // Additional Sensor
  case 5: // 추가된 수분장력센서
    return 251 + 100;
  case 61: // 추가된 RK520-02 EC
    return 242 + 100;
  case 62: // 추가된 RK520-02 HUMI
    return 248 + 100;
  case 63: // 추가된 RK520-02 TEMP
    return 257 + 100;
  default:
    Serial.println("Attempting to find the address of the register map with an invalid sensor type.");
    return 0;
  }
}

void checkSensorAwakeTime(int id)
{
  if (id == idRk52002Ec || id == idRk52002Humi || id == idRk52002Temp) // 41,42,43 -> 4(Rk52002)
  {
    id = idRk52002;
  }
  else if (id == idAddRk52002Ec || id == idAddRk52002Humi || id == idAddRk52002Temp)
  {
    id = idAddRk52002;
  }

  heartbeatTimes[id - 1] = millis(); // id 인덱스 배열에 시간저장
}

// 센서 타입(코드번호)으로 구분하여 레지스터 주소 설정
void resetSensorDataRegisters(int sensorType)
{
  // Complex Sensor Rk520-02
  if (sensorType == idRk52002)
  {
    const int ecAddress = 242;
    const int humiAddress = 248;
    const int tempAddress = 257;

    // ec 레지스터 주소
    registerMap[ecAddress] = 0;     // 242 : 0
    registerMap[ecAddress + 1] = 0; // 243 : 0
    registerMap[ecAddress + 2] = 1; // 244 : 1

    // 지습 레지스터 주소
    registerMap[humiAddress] = 0;     // 248 : 0
    registerMap[humiAddress + 1] = 0; // 249 : 0
    registerMap[humiAddress + 2] = 1; // 250 : 1

    // 지온 레지스터 주소
    registerMap[tempAddress] = 0;     // 257 : 0
    registerMap[tempAddress + 1] = 0; // 258 : 0
    registerMap[tempAddress + 2] = 1; // 259 : 1
  }
  else if (sensorType == idAddRk52002)
  {
    const int ecAddress = 242 + 100;
    const int humiAddress = 248 + 100;
    const int tempAddress = 257 + 100;

    registerMap[ecAddress] = 0;
    registerMap[ecAddress + 1] = 0;
    registerMap[ecAddress + 2] = 1;

    registerMap[humiAddress] = 0;
    registerMap[humiAddress + 1] = 0;
    registerMap[humiAddress + 2] = 1;

    registerMap[tempAddress] = 0;
    registerMap[tempAddress + 1] = 0;
    registerMap[tempAddress + 2] = 1;
  }
  // Other Sensors
  else
  {
    int registerAddress = getDataStoringIndex(sensorType);
    registerMap[registerAddress] = 0;
    registerMap[registerAddress + 1] = 0;
    registerMap[registerAddress + 2] = 1;
  }
}

void attachTeros21SoilWaterPotential()
{
  registerMap[117] = 15;
}

void attachWoosungRainDetector()
{
  registerMap[106] = 4;
}

void attachHaimilRainDetector()
{
  registerMap[106] = 4;
}

void attachRk52002()
{
  registerMap[114] = 12;
  registerMap[116] = 14;
  registerMap[119] = 17;
}

void getTeros21SoilWaterPotential()
{
  ESP32_SDI12::Status res = sdi12.measure(deviceAddr, sdi12Values, sizeof(sdi12Values), &numberOfReturnedValues);

