genesis0409/esp32_Daon_uxF_ISMS/src/main.cpp
  sendsOthersData = true;

  if (res != ESP32_SDI12::SDI12_OK)
  {
    Serial.printf("ESP32_SDI12 Error: %d\n", res);
    sendsOthersData = false; // 통신에 오류있으면 보내지 않음
  }
  float sensorValue = sdi12Values[0];
  Serial.print("Soil Water Potential: ");
  Serial.println(sensorValue);

  Serial.println("Debug Point 02 ************");

  Serial.print("SDI12 Arrays: ");
  for (int i = 0; i < sizeof(sdi12Values) / sizeof(sdi12Values[0]); i++)
  {
    Serial.printf("%.2f ", sdi12Values[i]);
  }
  Serial.println();

  const int soilWaterPotentialIndex = 251;
  saveFloatToRegisterMap(sdi12Values[0], soilWaterPotentialIndex);

  espnowData.id = idTeros21SoilWaterPotential;
  espnowData.sensorData = sdi12Values[0];
  espnowData.sensorState = 0;

  if (params.additionValue)
  {
    espnowData.id = idAddTeros21SoilWaterPotential;
  }
}

void getWoosungRainDetector()
{
  int digitalValue = digitalRead(el817Pin);
  if (digitalValue == LOW)
  {
    Serial.println("Rain Detected");
    rainValue = 1.0;
  }
  else
  {
    Serial.println("Rain Undetected");
    rainValue = 0.0;
  }

  const int rainDetectorIndex = 218;
  saveFloatToRegisterMap(rainValue, rainDetectorIndex);

  espnowData.id = idWoosungRainDetector;
  espnowData.sensorData = rainValue;
  espnowData.sensorState = 0;
}

void getHaimilRainDetector()
{
  int digitalValue = digitalRead(el817Pin);
  if (digitalValue == LOW)
  {
    Serial.println("Rain Detected");
    rainValue = 1.0;
  }
  else
  {
    Serial.println("Rain Undetected");
    rainValue = 0.0;
  }

  const int rainDetectorIndex = 218;
  saveFloatToRegisterMap(rainValue, rainDetectorIndex);

  espnowData.id = idHaimilRainDetector;
  espnowData.sensorData = rainValue;
  espnowData.sensorState = 0;
}

void getRk52002()
{
  byte request[] = {ADDR_RK52002, 0x03, 0x00, 0x00, 0x00, 0x03, 0x00, 0x00}; // RK520-02 8bytes Request
  int reqLen = sizeof(request) / sizeof(request[0]);

  addCrc(request, reqLen); // CRC 붙이기

  digitalWrite(rs485TxEnPin, HIGH); // HIGH: 송신 모드 활성화
  Serial2.write(request, reqLen);   // request 배열의 데이터를 Serial2로 전송
  Serial2.flush();                  // 송신 버퍼에 남아있는 데이터가 모두 전송될 때까지 대기
  digitalWrite(rs485TxEnPin, LOW);  // 모든 데이터가 전송된 이후 송신 모드 비활성화 (LOW)

  delay(100);

  // modbus 응답 처리 ****************************************************************
  byte response[11] = {0}; // 배열 0으로 초기화 선언
  int responseLen = 0;

  bool validStart = false; // 유효한 modbus 응답이 왔는지 flag

  // response 배열을 채우는 while문
  while (responseLen < sizeof(response) / sizeof(response[0])) // 길이가 11보다 작으면 수행
  {
    if (!Serial2.available())
    {
      break; // 데이터가 더 이상 없으면 종료
    }

    byte incomingByte = Serial2.read();                   // 한 바이트 읽고
    if (incomingByte == ADDR_RK52002 && responseLen == 0) // 유효 시작바이트가 RK52002 주소
    {
      // 정상적인 Modbus 신호 시작 (0xFE)
      validStart = true;
      Serial.print("Rk520-02 response: ");
    }

    if (validStart)
    {
      // Serial 모니터 출력부
      if (incomingByte < 0x10) // 16진수 출력 포맷 자릿수
      {
        Serial.print("0");
      }
      Serial.print(incomingByte, HEX); // 16진수 출력
      Serial.print(" ");               // 각 바이트 사이의 공백

      response[responseLen++] = incomingByte; // 대입연산 수행 후 증가

      if (responseLen == sizeof(response) / sizeof(response[0]))
      {
        // 11바이트가 모두 수신되면 종료
        break;
      }
    } // if (validStart)
  } // while

  Serial.println();

  Serial.print("Response length: ");
  Serial.println(responseLen);

  if (hasCrcError(response, responseLen))
  {
    sendsOthersData = false; // 나머지 data도 보내지 않음
    Serial.println("Sensor Response CRC error");
  }
  else
  {
    sendsOthersData = true;

    byte tempHigh = response[3];
    byte tempLow = response[4];
    byte humiHigh = response[5];
    byte humiLow = response[6];
    byte ecHigh = response[7];
    byte ecLow = response[8];

    float temp = 0.0;
    float humi = 0.0;
    float ec = 0.0;

    int tempData = tempHigh * 256 + tempLow;
    if (tempData < 0x8000)
    {
      temp = tempData / 10.0;
    }
    else
    {
      temp = (tempData - 0xFFFF - 0x01) / 10.0;
    }
    humi = (humiHigh * 256 + humiLow) / 10.0;
    ec = (ecHigh * 256 + ecLow) / 1000.0;

    // Send message via ESP-NOW
    espnowData.sensorState = 0;
    esp_err_t result;

    espnowData.id = idRk52002Ec;
    espnowData.sensorData = ec;
    if (params.additionValue)
    {
      espnowData.id = idAddRk52002Ec;
    }
    result = esp_now_send(params.newMacAddress, (uint8_t *)&espnowData, sizeof(espnowData));
    if (result != ESP_OK)
    {
      Serial.println("Error : send esp-now RK520-02: EC data.");
      Serial.print("Code: ");
      Serial.println(result);
    }
    delay(1);

    espnowData.id = idRk52002Humi;
    espnowData.sensorData = humi;
    if (params.additionValue)
    {
      espnowData.id = idAddRk52002Humi;
    }
    result = esp_now_send(params.newMacAddress, (uint8_t *)&espnowData, sizeof(espnowData));
    if (result != ESP_OK)
    {
      Serial.println("Error : send esp-now RK520-02: Humi data.");
      Serial.print("Code: ");
      Serial.println(result);
    }
    delay(1);

    espnowData.id = idRk52002Temp;
    espnowData.sensorData = temp;
    if (params.additionValue)
    {
      espnowData.id = idAddRk52002Temp;
    }
    // 왜 여기 밑이 없지? -> 배터리 전압값 포함해서 온도랑 같이 보내기 때문인듯
  }
}
